tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "tmspzz/tap", "https://github.com/tmspzz/homebrew-tap.git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Identify or delete duplicate files
brew "fdupes"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Rsync for cloud storage
brew "rclone"
# Display and control your Android device
brew "scrcpy"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Metadata cleaner
cask "exifcleaner"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
cask "kapitainsky-rclone-browser"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# Open-source software for live streaming and screen recording
cask "obs"
# File system integration
cask "osxfuse"
cask "rclone-browser"
# GUI for rclone
cask "rcloneosx"
# Tool to manage the size and position of windows
cask "shiftit"
# Instant messaging application focusing on security
cask "signal"
# Break time reminder app
cask "stretchly"
# Customizable email client
cask "thunderbird"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
