tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "tmspzz/tap", "https://github.com/tmspzz/homebrew-tap.git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Easiest way to build and release mobile apps
brew "fastlane"
# Identify or delete duplicate files
brew "fdupes"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# NCurses Disk Usage
brew "ncdu"
# Platform built on V8 to build network applications
brew "node"
# Object-relational database system
brew "postgresql"
# Rsync for cloud storage
brew "rclone"
# Display and control your Android device
brew "scrcpy"
# Meta-programming for Swift, stop writing boilerplate code
brew "sourcery"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift code generator for assets, storyboards, Localizable.strings, …
brew "swiftgen"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Lightweight BitTorrent client
brew "transmission-cli"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# A shared cache tool for Carthage
brew "tmspzz/tap/rome"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Allows connection to a computer remotely
cask "anydesk"
# Metadata cleaner
cask "exifcleaner"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
cask "kapitainsky-rclone-browser"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# Interface for reading and syncing eBooks
cask "kindle"
# Open-source software for live streaming and screen recording
cask "obs"
# File system integration
cask "osxfuse"
# Collaboration platform for API development
cask "postman"
cask "rclone-browser"
# GUI for rclone
cask "rcloneosx"
# Tool to manage the size and position of windows
cask "shiftit"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Break time reminder app
cask "stretchly"
# Customizable email client
cask "thunderbird"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# App wrapper for music.youtube.com
cask "yt-music"
