jorgebucaran/fisher
jethrokuan/z
franciscolourenco/done
jorgebucaran/spark.fish
jorgebucaran/getopts.fish
jhillyerd/plugin-git
oh-my-fish/plugin-brew
oh-my-fish/plugin-osx
ilancosman/tide@v6
